# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index.

In [1]:
import pandas as pd
import numpy as np

from numpy.random import randn
np.random.seed(101)

Check out usage of DataFrame: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html

In [2]:
df = pd.DataFrame(data = np.random.randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [3]:
df

          W         X         Y         Z
A -0.241454 -0.273974 -0.038192  0.114451
B -0.178157  1.798978 -0.895596  1.820285
C  0.048094 -1.375768 -0.942589  0.241366
D  0.603936  0.898270  0.065562  2.037053
E  0.052805  0.755994  0.706333  1.003772

In [4]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [5]:
df.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [6]:
df['W']

A   -0.241454
B   -0.178157
C    0.048094
D    0.603936
E    0.052805
Name: W, dtype: float64

In [12]:
# Pass a list of column names
df[['W','Z']]
# df['W', 'Z']

          W         Z
A -0.241454  0.114451
B -0.178157  1.820285
C  0.048094  0.241366
D  0.603936  2.037053
E  0.052805  1.003772

DataFrame Columns are just Series

In [13]:
type(df['W'])

pandas.core.series.Series

**Creating a new column:**

In [20]:
df['new'] = df['W']+df['Y']

In [22]:
df

          W         X         Y         Z       new
A -0.241454 -0.273974 -0.038192  0.114451 -0.279646
B -0.178157  1.798978 -0.895596  1.820285 -1.073753
C  0.048094 -1.375768 -0.942589  0.241366 -0.894495
D  0.603936  0.898270  0.065562  2.037053  0.669499
E  0.052805  0.755994  0.706333  1.003772  0.759138

In [27]:
df['new'] = np.exp(df['W'])+ np.sin(df['Y'])

In [28]:
df

          W         X         Y         Z       new
A -0.241454 -0.273974 -0.038192  0.114451  0.747302
B -0.178157  1.798978 -0.895596  1.820285  0.056229
C  0.048094 -1.375768 -0.942589  0.241366  0.240187
D  0.603936  0.898270  0.065562  2.037053  1.894820
E  0.052805  0.755994  0.706333  1.003772  1.703273

** Removing Columns**

In [29]:
df.drop('new',axis=1) # axis = 1: remove column

          W         X         Y         Z
A -0.241454 -0.273974 -0.038192  0.114451
B -0.178157  1.798978 -0.895596  1.820285
C  0.048094 -1.375768 -0.942589  0.241366
D  0.603936  0.898270  0.065562  2.037053
E  0.052805  0.755994  0.706333  1.003772

In [30]:
# Not inplace unless specified!  inplace means the data is modified in place. 
# default value is false for inplace
df

          W         X         Y         Z       new
A -0.241454 -0.273974 -0.038192  0.114451  0.747302
B -0.178157  1.798978 -0.895596  1.820285  0.056229
C  0.048094 -1.375768 -0.942589  0.241366  0.240187
D  0.603936  0.898270  0.065562  2.037053  1.894820
E  0.052805  0.755994  0.706333  1.003772  1.703273

In [31]:
df.drop('new',axis=1,inplace=True)

In [32]:
df

          W         X         Y         Z
A -0.241454 -0.273974 -0.038192  0.114451
B -0.178157  1.798978 -0.895596  1.820285
C  0.048094 -1.375768 -0.942589  0.241366
D  0.603936  0.898270  0.065562  2.037053
E  0.052805  0.755994  0.706333  1.003772

Can also drop rows this way:

In [35]:
df.drop('E', axis=0) # axis = 0: remove row

          W         X         Y         Z
A -0.241454 -0.273974 -0.038192  0.114451
B -0.178157  1.798978 -0.895596  1.820285
C  0.048094 -1.375768 -0.942589  0.241366
D  0.603936  0.898270  0.065562  2.037053

In [36]:
df

          W         X         Y         Z
A -0.241454 -0.273974 -0.038192  0.114451
B -0.178157  1.798978 -0.895596  1.820285
C  0.048094 -1.375768 -0.942589  0.241366
D  0.603936  0.898270  0.065562  2.037053
E  0.052805  0.755994  0.706333  1.003772

** Selecting Rows**

In [53]:
df.loc['A']

W    0.273502
X    0.650319
Y   -0.364917
Z   -1.015161
Name: A, dtype: float64

Or select based off of position instead of label

df.iloc[0]

** Selecting subset of rows and columns **

In [37]:
df

          W         X         Y         Z
A -0.241454 -0.273974 -0.038192  0.114451
B -0.178157  1.798978 -0.895596  1.820285
C  0.048094 -1.375768 -0.942589  0.241366
D  0.603936  0.898270  0.065562  2.037053
E  0.052805  0.755994  0.706333  1.003772

In [38]:
df.loc['B','Y']

-0.8955955280548551

In [25]:
df.loc[['A','B'],['W','Y']]

          W         Y
A -0.877987  0.881181
B  0.583198  1.110507

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [39]:
df

          W         X         Y         Z
A -0.241454 -0.273974 -0.038192  0.114451
B -0.178157  1.798978 -0.895596  1.820285
C  0.048094 -1.375768 -0.942589  0.241366
D  0.603936  0.898270  0.065562  2.037053
E  0.052805  0.755994  0.706333  1.003772

In [40]:
df>0

       W      X      Y     Z
A  False  False  False  True
B  False   True  False  True
C   True  False  False  True
D   True   True   True  True
E   True   True   True  True

In [41]:
df[df>0]

          W         X         Y         Z
A       NaN       NaN       NaN  0.114451
B       NaN  1.798978       NaN  1.820285
C  0.048094       NaN       NaN  0.241366
D  0.603936  0.898270  0.065562  2.037053
E  0.052805  0.755994  0.706333  1.003772

In [42]:
df

          W         X         Y         Z
A -0.241454 -0.273974 -0.038192  0.114451
B -0.178157  1.798978 -0.895596  1.820285
C  0.048094 -1.375768 -0.942589  0.241366
D  0.603936  0.898270  0.065562  2.037053
E  0.052805  0.755994  0.706333  1.003772

In [43]:
df[df['W']>0]

          W         X         Y         Z
C  0.048094 -1.375768 -0.942589  0.241366
D  0.603936  0.898270  0.065562  2.037053
E  0.052805  0.755994  0.706333  1.003772

In [46]:
df[df['W']>0][['W','Y'] ]

          W         Y
C  0.048094 -0.942589
D  0.603936  0.065562
E  0.052805  0.706333

In [47]:
df[df['W']>0][['Y','X'] ]

          Y         X
C -0.942589 -1.375768
D  0.065562  0.898270
E  0.706333  0.755994

In [48]:
df

          W         X         Y         Z
A -0.241454 -0.273974 -0.038192  0.114451
B -0.178157  1.798978 -0.895596  1.820285
C  0.048094 -1.375768 -0.942589  0.241366
D  0.603936  0.898270  0.065562  2.037053
E  0.052805  0.755994  0.706333  1.003772

For two conditions you can use | and & with parenthesis:

In [53]:
df[(df['W']>0) | (df['Y'] > 0)]

          W         X         Y         Z
C  0.048094 -1.375768 -0.942589  0.241366
D  0.603936  0.898270  0.065562  2.037053
E  0.052805  0.755994  0.706333  1.003772

In [57]:
df[(df['W']>0)&(df['Y'] > 0)][['W','X']]

          W         X
D  0.603936  0.898270
E  0.052805  0.755994

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [58]:
df

          W         X         Y         Z
A -0.241454 -0.273974 -0.038192  0.114451
B -0.178157  1.798978 -0.895596  1.820285
C  0.048094 -1.375768 -0.942589  0.241366
D  0.603936  0.898270  0.065562  2.037053
E  0.052805  0.755994  0.706333  1.003772

In [59]:
# Reset to default 0,1...n index
df.reset_index()

  index         W         X         Y         Z
0     A -0.241454 -0.273974 -0.038192  0.114451
1     B -0.178157  1.798978 -0.895596  1.820285
2     C  0.048094 -1.375768 -0.942589  0.241366
3     D  0.603936  0.898270  0.065562  2.037053
4     E  0.052805  0.755994  0.706333  1.003772

In [61]:
newind = 'CA NY WY OR CO'.split()
print(newind)

['CA', 'NY', 'WY', 'OR', 'CO']

In [62]:
df['States'] = newind

In [42]:
df

          W         X         Y         Z States
A -0.877987  0.138974  0.881181  0.239446     CA
B  0.583198 -1.642620  1.110507  1.432493     NY
C -1.032279  0.813693 -1.120451 -1.437548     WY
D -0.449829  1.182019 -0.370765 -0.052422     OR
E -0.672629  0.742708  1.026254  0.534265     CO

In [63]:
df.set_index('States') # set states as the index

               W         X         Y         Z
States
CA     -0.241454 -0.273974 -0.038192  0.114451
NY     -0.178157  1.798978 -0.895596  1.820285
WY      0.048094 -1.375768 -0.942589  0.241366
OR      0.603936  0.898270  0.065562  2.037053
CO      0.052805  0.755994  0.706333  1.003772

In [44]:
df

          W         X         Y         Z States
A -0.877987  0.138974  0.881181  0.239446     CA
B  0.583198 -1.642620  1.110507  1.432493     NY
C -1.032279  0.813693 -1.120451 -1.437548     WY
D -0.449829  1.182019 -0.370765 -0.052422     OR
E -0.672629  0.742708  1.026254  0.534265     CO

In [64]:
df.set_index('States',inplace=True)

In [65]:
df

               W         X         Y         Z
States
CA     -0.241454 -0.273974 -0.038192  0.114451
NY     -0.178157  1.798978 -0.895596  1.820285
WY      0.048094 -1.375768 -0.942589  0.241366
OR      0.603936  0.898270  0.065562  2.037053
CO      0.052805  0.755994  0.706333  1.003772

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [68]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [69]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [70]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  0.992418  1.051769
   2 -0.070223 -0.074197
   3  1.672965  1.592670
G2 1 -1.287934  1.006020
   2  0.856027 -0.124471
   3  0.034574 -0.050165

Now let's show how to index this! For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

In [71]:
df.loc['G1']

          A         B
1  0.992418  1.051769
2 -0.070223 -0.074197
3  1.672965  1.592670

In [93]:
df.loc['G1'].loc[1]

A    0.339304
B    1.003962
Name: 1, dtype: float64

In [72]:
df.index.names

FrozenList([None, None])

In [79]:
df.index.names = ['Group','Num']

In [80]:
df

                  A         B
Group Num
G1    1    0.992418  1.051769
      2   -0.070223 -0.074197
      3    1.672965  1.592670
G2    1   -1.287934  1.006020
      2    0.856027 -0.124471
      3    0.034574 -0.050165

Check out the usage of **pandas.DataFrame.xs**: https://pandas.pydata.org/pandas-docs/version/0.22/generated/pandas.DataFrame.xs.html

In [74]:
df.xs('G1')

            A         B
Num
1    0.992418  1.051769
2   -0.070223 -0.074197
3    1.672965  1.592670

In [75]:
df.loc['G1']

            A         B
Num
1    0.992418  1.051769
2   -0.070223 -0.074197
3    1.672965  1.592670

In [76]:
df.xs(['G1',1])

A    0.992418
B    1.051769
Name: (G1, 1), dtype: float64

In [77]:
df.loc['G1'].loc[1]

A    0.992418
B    1.051769
Name: 1, dtype: float64

In [78]:
df.xs(2,level='Num')

              A         B
Group
G1    -0.070223 -0.074197
G2     0.856027 -0.124471

In [81]:
df

                  A         B
Group Num
G1    1    0.992418  1.051769
      2   -0.070223 -0.074197
      3    1.672965  1.592670
G2    1   -1.287934  1.006020
      2    0.856027 -0.124471
      3    0.034574 -0.050165